[
  {
    "id": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/tXLZKqh/gatsby.jpg",
    "review": "A timeless classic exploring the American Dream and the dark underbelly of wealth and privilege. Fitzgerald's prose dances with elegance, painting a vivid portrait of the Jazz Age and its extravagant parties, while also delving into the complexities of love, betrayal, and the human condition. The Great Gatsby remains a poignant reflection on the pursuit of the elusive and often hollow promise of the American Dream.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Classics", "Romance", "Drama"],
    "publisher": "Scribner",
    "publishing_year": 1925
  },
  {
    "id": 2,
    "bookName": "Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/RSPt0q2/mockingbird.jpg",
    "review": "A poignant portrayal of racial injustice and moral growth in the American South. Through the eyes of Scout Finch, Lee masterfully captures the innocence of childhood alongside the harsh realities of prejudice and discrimination, creating a narrative that resonates with readers of all ages. To Kill a Mockingbird is a timeless reminder of the importance of empathy, compassion, and standing up for what is right.",
    "totalPages": 324,
    "rating": 4.7,
    "category": "Social Issues",
    "tags": ["Classic", "Coming of Age", "Social Issues"],
    "publisher": "J.B. Lippincott & Co.",
    "publishing_year": 1960
  },
  {
    "id": 3,
    "bookName": "Nineteen Eighty-Four",
    "author": "George Orwell",
    "image": "https://i.ibb.co/2FZzKhs/1984.jpg",
    "review": "A chilling dystopian novel that warns of the dangers of totalitarianism and surveillance. Orwell's bleak vision of a future society where individuality is suppressed and truth is manipulated serves as a stark reminder of the importance of freedom and truth in society. 1984 is a haunting exploration of power, control, and the consequences of unchecked authority that remains alarmingly relevant in today's world.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political", "Social Commentary"],
    "publisher": "Secker & Warburg",
    "publishing_year": 1949
  },
  {
    "id": 4,
    "bookName": "Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/L5m3CPn/catcher.jpg",
    "review": "A coming-of-age novel that captures the disillusionment of youth and the search for authenticity. Salinger's iconic protagonist, Holden Caulfield, navigates the complexities of adolescence with wit and vulnerability, making this novel a timeless portrayal of teenage angst. The Catcher in the Rye is a poignant exploration of alienation, identity, and the struggle to find one's place in a world that often feels insincere.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Classic", "Teen", "Alienation"],
    "publisher": "Little, Brown and Company",
    "publishing_year": 1951
  },
  {
    "id": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/dpNHf30/pride.jpg",
    "review": "A delightful romantic comedy of manners, exploring themes of love, class, and marriage. Austen's keen observations of society and witty dialogue create a captivating narrative that continues to charm readers across generations. Pride and Prejudice is a timeless tale of love and misunderstanding, filled with memorable characters and sparkling wit.",
    "totalPages": 279,
    "rating": 4.8,
    "category": "Romance",
    "tags": ["Romance", "Classic", "Satire"],
    "publisher": "T. Egerton, Whitehall",
    "publishing_year": 1813
  },
  {
    "id": 6,
    "bookName": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "image": "https://i.ibb.co/k825X7C/crime.jpg",
    "review": "A psychological thriller that delves into the depths of human consciousness and morality. Dostoevsky's exploration of guilt, redemption, and the human condition is both gripping and thought-provoking, making this novel a cornerstone of Russian literature. Crime and Punishment is an intense and philosophical examination of morality, suffering, and the pursuit of justice.",
    "totalPages": 551,
    "rating": 4.6,
    "category": "Psychological Thriller",
    "tags": ["Psychological", "Philosophical"],
    "publisher": "The Russian Messenger",
    "publishing_year": 1866
  },
  {
    "id": 7,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/HXrg1hy/hobbit.jpg",
    "review": "An enchanting adventure through Middle-earth, filled with dwarves, wizards, and dragons. Tolkien's imaginative world-building and epic storytelling make 'The Hobbit' a timeless classic that continues to captivate readers of all ages. The Hobbit is a magical journey of courage, friendship, and the triumph of good over evil, set against the backdrop of a richly",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Adventure", "Quest", "Magic"],
    "publisher": "Allen & Unwin",
    "publishing_year": 1937
  },

  {
    "id": 8,
    "bookName": "Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/qBk7vJs/vinci.jpg",
    "review": "A gripping thriller that combines art, religion, and conspiracy in a fast-paced adventure. Brown's masterful blend of history and fiction keeps readers on the edge of their seats, unraveling mysteries that challenge the very foundations of belief. The Da Vinci Code is an exhilarating rollercoaster ride of secrets, codes, and hidden truths that will leave you questioning everything you thought you knew.",
    "totalPages": 454,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Thriller", "Mystery", "Conspiracy"],
    "publisher": "Doubleday",
    "publishing_year": 2003
  },
  {
    "id": 9,
    "bookName": "Harry Potter",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/gjgYbT5/harry.jpg",
    "review": "A magical tale of friendship, bravery, and the battle between good and evil in the wizarding world. Rowling's imaginative storytelling and richly drawn characters make 'Harry Potter' a modern classic that continues to inspire readers of all ages. Harry Potter and the Philosopher's Stone is an enchanting introduction to the world of Hogwarts, where ordinary children discover extraordinary powers and embark on thrilling adventures.",
    "totalPages": 309,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure", "Young Adult"],
    "publisher": "Bloomsbury",
    "publishing_year": 1997
  }
]
